### Terraform Plan

<details><summary>Ver plan</summary>




digitalocean_droplet.hazelcast_poc: Refreshing state... [id=522915911]
digitalocean_record.hazelcast_subdomain: Refreshing state... [id=1793884984]
digitalocean_firewall.hazelcast_fw: Refreshing state... [id=0ff9e39c-29e6-4430-8f55-f6d681827125]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # digitalocean_droplet.hazelcast_poc must be replaced
-/+ resource "digitalocean_droplet" "hazelcast_poc" {
      ~ created_at           = "2025-10-06T20:16:18Z" -> (known after apply)
      ~ disk                 = 25 -> (known after apply)
      ~ id                   = "522915911" -> (known after apply)
      ~ ipv4_address         = "104.131.174.157" -> (known after apply)
      ~ ipv4_address_private = "10.108.0.2" -> (known after apply)
      + ipv6_address         = (known after apply)
      ~ locked               = false -> (known after apply)
      ~ memory               = 1024 -> (known after apply)
        name                 = "hazelcast-poc-droplet"
      ~ price_hourly         = 0.00893 -> (known after apply)
      ~ price_monthly        = 6 -> (known after apply)
      ~ private_networking   = true -> (known after apply)
      ~ ssh_keys             = [ # forces replacement
          - "51226698",
          + "51233716",
        ]
      ~ status               = "active" -> (known after apply)
        tags                 = [
            "hazelcast-poc",
        ]
      ~ urn                  = "do:droplet:522915911" -> (known after apply)
      ~ vcpus                = 1 -> (known after apply)
      ~ volume_ids           = [] -> (known after apply)
      ~ vpc_uuid             = "42995ae8-2b24-4a09-b3a4-8ce0e4552b5b" -> (known after apply)
        # (9 unchanged attributes hidden)
    }

  # digitalocean_firewall.hazelcast_fw will be updated in-place
  ~ resource "digitalocean_firewall" "hazelcast_fw" {
      ~ droplet_ids     = [
          - 522915911,
        ] -> (known after apply)
        id              = "0ff9e39c-29e6-4430-8f55-f6d681827125"
        name            = "hazelcast-poc-fw"
        tags            = []
        # (3 unchanged attributes hidden)

      - outbound_rule {
          - destination_addresses          = [
              - "0.0.0.0/0",
              - "::/0",
            ] -> null
          - destination_droplet_ids        = [] -> null
          - destination_kubernetes_ids     = [] -> null
          - destination_load_balancer_uids = [] -> null
          - destination_tags               = [] -> null
          - port_range                     = "all" -> null
          - protocol                       = "tcp" -> null
        }
      - outbound_rule {
          - destination_addresses          = [
              - "0.0.0.0/0",
              - "::/0",
            ] -> null
          - destination_droplet_ids        = [] -> null
          - destination_kubernetes_ids     = [] -> null
          - destination_load_balancer_uids = [] -> null
          - destination_tags               = [] -> null
          - port_range                     = "all" -> null
          - protocol                       = "udp" -> null
        }
      + outbound_rule {
          + destination_addresses          = [
              + "0.0.0.0/0",
              + "::/0",
            ]
          + destination_droplet_ids        = []
          + destination_kubernetes_ids     = []
          + destination_load_balancer_uids = []
          + destination_tags               = []
          + port_range                     = "0"
          + protocol                       = "tcp"
        }
      + outbound_rule {
          + destination_addresses          = [
              + "0.0.0.0/0",
              + "::/0",
            ]
          + destination_droplet_ids        = []
          + destination_kubernetes_ids     = []
          + destination_load_balancer_uids = []
          + destination_tags               = []
          + port_range                     = "0"
          + protocol                       = "udp"
        }

        # (3 unchanged blocks hidden)
    }

  # digitalocean_record.hazelcast_subdomain will be updated in-place
  ~ resource "digitalocean_record" "hazelcast_subdomain" {
        id       = "1793884984"
        name     = "hazelcast"
      ~ value    = "104.131.174.157" -> (known after apply)
        # (8 unchanged attributes hidden)
    }

Plan: 1 to add, 2 to change, 1 to destroy.

Changes to Outputs:
  ~ droplet_ip = "104.131.174.157" -> (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.


</details>